/*********************************************************************************************
* 文件：zxbee-sys-command.c
* 作者：Xuzhy 2018.5.16
* 说明：ZXBee通信协议数据包命令解析
* 修改：fuyou 增加透传驱动部分
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include <stdio.h>
#include <string.h>
#include <osal.h>
#include "zxbee.h"
#include "at.h"
#include "sensor.h"
/*********************************************************************************************
* 名称：ZXBeeSysCommandProc()
* 功能：ZXBee通信协议数据包命令解析
* 参数：*ptag -- 变量；*pval -- 值
* 返回：
* 修改：
* 注释：
*********************************************************************************************/

int ZXBeeSysCommandProc(char *ptag, char *pval)
{
  char buf[20];
  
  if (osal_memcmp(ptag, "TYPE", 4)) {
#ifndef CC2540_Serial
    buf[5] = '\0';
    sprintf(buf, "42%s", NODE_NAME);
    ZXBeeAdd("TYPE", buf); 
#else
    sprintf(buf,"AT+TYPE?\r\n");
    at_notify_data(buf,strlen(buf));
#endif     
    return 0;
  }
  return -1;
}
